# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'prettyping'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'svn' # to could install fonts
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
# brew 'jpegoptim'
# brew 'optipng'
# brew 'pngquant'
# brew 'svgo'
# brew 'gifsicle'

# Development
brew 'php'
brew 'php@7.4'
brew 'php@7.3'
brew 'composer'
brew 'libmemcached'
brew 'meilisearch'
brew 'memcached'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'

# Apps
cask '1password'
cask '1password-cli'
cask 'backblaze'
cask 'brave-browser'
cask 'cleanmymac'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'figma'
cask 'gpg-suite'
cask 'helo'
cask 'iterm2'
cask 'linear'
cask 'phpstorm'
cask 'postman'
cask 'screenflow'
cask 'slack'
cask 'spectacle'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'tower'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# Quicklook
cask 'qlmarkdown'
cask 'quicklook-json'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Bear', id: 1091189122
mas 'Caffeinated', id: 1362171212
mas 'Grammarly for Safari', id: 1462114288
mas 'iA Writer', id: 775737590
mas 'Keynote', id: 409183694
mas 'Microsoft Excel', id: 462058435
mas 'MindNode', id: 1289197285
mas 'Numbers', id: 409203825
mas 'TweetDeck', id: 485812721
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
